bmaayandexru/Polish/Drivers/LPC1768_define.h

#ifndef __LPC1768_DEFINE_H__
#define __LPC1768_DEFINE_H__


/**************************************************/
/*   КОНСТРУКТОР БАЙТОВ                           */
/**************************************************/
// Использовать для сборки 16- и 32- разрядных чисел
// Например:
// 32-разрядное число 00001111001100110000000011111111
// задается так: (b00001111 byte3) | (b00110011 byte2) | (b00000000 byte1) | (b11111111 byte0)
#define byte0 << 0
#define byte1 << 8
#define byte2 << 16
#define byte3 << 24


/**************************************************/
/*   ДВОИЧНЫЕ ГРУППЫ                              */
/**************************************************/
//использовать вместо двоичных чисел
#define b00 0UL
#define b01 1UL
#define b10 2UL
#define b11 3UL

#define b000 0UL
#define b001 1UL
#define b010 2UL
#define b011 3UL
#define b100 4UL
#define b101 5UL
#define b110 6UL
#define b111 7UL

#define b0000 0UL
#define b0001 1UL
#define b0010 2UL
#define b0011 3UL
#define b0100 4UL
#define b0101 5UL
#define b0110 6UL
#define b0111 7UL
#define b1000 8UL
#define b1001 9UL
#define b1010 10UL
#define b1011 11UL
#define b1100 12UL
#define b1101 13UL
#define b1110 14UL
#define b1111 15UL

#define b00000000 0UL
#define b00000001 1UL
#define b00000010 2UL
#define b00000011 3UL
#define b00000100 4UL
#define b00000101 5UL
#define b00000110 6UL
#define b00000111 7UL
#define b00001000 8UL
#define b00001001 9UL
#define b00001010 10UL
#define b00001011 11UL
#define b00001100 12UL
#define b00001101 13UL
#define b00001110 14UL
#define b00001111 15UL
#define b00010000 16UL
#define b00010001 17UL
#define b00010010 18UL
#define b00010011 19UL
#define b00010100 20UL
#define b00010101 21UL
#define b00010110 22UL
#define b00010111 23UL
#define b00011000 24UL
#define b00011001 25UL
#define b00011010 26UL
#define b00011011 27UL
#define b00011100 28UL
#define b00011101 29UL
#define b00011110 30UL
#define b00011111 31UL
#define b00100000 32UL
#define b00100001 33UL
#define b00100010 34UL
#define b00100011 35UL
#define b00100100 36UL
#define b00100101 37UL
#define b00100110 38UL
#define b00100111 39UL
#define b00101000 40UL
#define b00101001 41UL
#define b00101010 42UL
#define b00101011 43UL
#define b00101100 44UL
#define b00101101 45UL
#define b00101110 46UL
#define b00101111 47UL
#define b00110000 48UL
#define b00110001 49UL
#define b00110010 50UL
#define b00110011 51UL
#define b00110100 52UL
#define b00110101 53UL
#define b00110110 54UL
#define b00110111 55UL
#define b00111000 56UL
#define b00111001 57UL
#define b00111010 58UL
#define b00111011 59UL
#define b00111100 60UL
#define b00111101 61UL
#define b00111110 62UL
#define b00111111 63UL
#define b01000000 64UL
#define b01000001 65UL
#define b01000010 66UL
#define b01000011 67UL
#define b01000100 68UL
#define b01000101 69UL
#define b01000110 70UL
#define b01000111 71UL
#define b01001000 72UL
#define b01001001 73UL
#define b01001010 74UL
#define b01001011 75UL
#define b01001100 76UL
#define b01001101 77UL
#define b01001110 78UL
#define b01001111 79UL
#define b01010000 80UL
#define b01010001 81UL
#define b01010010 82UL
#define b01010011 83UL
#define b01010100 84UL
#define b01010101 85UL
#define b01010110 86UL
#define b01010111 87UL
#define b01011000 88UL
#define b01011001 89UL
#define b01011010 90UL
#define b01011011 91UL
#define b01011100 92UL
#define b01011101 93UL
#define b01011110 94UL
#define b01011111 95UL
#define b01100000 96UL
#define b01100001 97UL
#define b01100010 98UL
#define b01100011 99UL
#define b01100100 100UL
#define b01100101 101UL
#define b01100110 102UL
#define b01100111 103UL
#define b01101000 104UL
#define b01101001 105UL
#define b01101010 106UL
#define b01101011 107UL
#define b01101100 108UL
#define b01101101 109UL
#define b01101110 110UL
#define b01101111 111UL
#define b01110000 112UL
#define b01110001 113UL
#define b01110010 114UL
#define b01110011 115UL
#define b01110100 116UL
#define b01110101 117UL
#define b01110110 118UL
#define b01110111 119UL
#define b01111000 120UL
#define b01111001 121UL
#define b01111010 122UL
#define b01111011 123UL
#define b01111100 124UL
#define b01111101 125UL
#define b01111110 126UL
#define b01111111 127UL
#define b10000000 128UL
#define b10000001 129UL
#define b10000010 130UL
#define b10000011 131UL
#define b10000100 132UL
#define b10000101 133UL
#define b10000110 134UL
#define b10000111 135UL
#define b10001000 136UL
#define b10001001 137UL
#define b10001010 138UL
#define b10001011 139UL
#define b10001100 140UL
#define b10001101 141UL
#define b10001110 142UL
#define b10001111 143UL
#define b10010000 144UL
#define b10010001 145UL
#define b10010010 146UL
#define b10010011 147UL
#define b10010100 148UL
#define b10010101 149UL
#define b10010110 150UL
#define b10010111 151UL
#define b10011000 152UL
#define b10011001 153UL
#define b10011010 154UL
#define b10011011 155UL
#define b10011100 156UL
#define b10011101 157UL
#define b10011110 158UL
#define b10011111 159UL
#define b10100000 160UL
#define b10100001 161UL
#define b10100010 162UL
#define b10100011 163UL
#define b10100100 164UL
#define b10100101 165UL
#define b10100110 166UL
#define b10100111 167UL
#define b10101000 168UL
#define b10101001 169UL
#define b10101010 170UL
#define b10101011 171UL
#define b10101100 172UL
#define b10101101 173UL
#define b10101110 174UL
#define b10101111 175UL
#define b10110000 176UL
#define b10110001 177UL
#define b10110010 178UL
#define b10110011 179UL
#define b10110100 180UL
#define b10110101 181UL
#define b10110110 182UL
#define b10110111 183UL
#define b10111000 184UL
#define b10111001 185UL
#define b10111010 186UL
#define b10111011 187UL
#define b10111100 188UL
#define b10111101 189UL
#define b10111110 190UL
#define b10111111 191UL
#define b11000000 192UL
#define b11000001 193UL
#define b11000010 194UL
#define b11000011 195UL
#define b11000100 196UL
#define b11000101 197UL
#define b11000110 198UL
#define b11000111 199UL
#define b11001000 200UL
#define b11001001 201UL
#define b11001010 202UL
#define b11001011 203UL
#define b11001100 204UL
#define b11001101 205UL
#define b11001110 206UL
#define b11001111 207UL
#define b11010000 208UL
#define b11010001 209UL
#define b11010010 210UL
#define b11010011 211UL
#define b11010100 212UL
#define b11010101 213UL
#define b11010110 214UL
#define b11010111 215UL
#define b11011000 216UL
#define b11011001 217UL
#define b11011010 218UL
#define b11011011 219UL
#define b11011100 220UL
#define b11011101 221UL
#define b11011110 222UL
#define b11011111 223UL
#define b11100000 224UL
#define b11100001 225UL
#define b11100010 226UL
#define b11100011 227UL
#define b11100100 228UL
#define b11100101 229UL
#define b11100110 230UL
#define b11100111 231UL
#define b11101000 232UL
#define b11101001 233UL
#define b11101010 234UL
#define b11101011 235UL
#define b11101100 236UL
#define b11101101 237UL
#define b11101110 238UL
#define b11101111 239UL
#define b11110000 240UL
#define b11110001 241UL
#define b11110010 242UL
#define b11110011 243UL
#define b11110100 244UL
#define b11110101 245UL
#define b11110110 246UL
#define b11110111 247UL
#define b11111000 248UL
#define b11111001 249UL
#define b11111010 250UL
#define b11111011 251UL
#define b11111100 252UL
#define b11111101 253UL
#define b11111110 254UL
#define b11111111 255UL


/**************************************************/
/*   Port Pins                                    */
/**************************************************/
#define PIN0  (1UL << 0)
#define PIN1  (1UL << 1)
#define PIN2  (1UL << 2)
#define PIN3  (1UL << 3)
#define PIN4  (1UL << 4)
#define PIN5  (1UL << 5)
#define PIN6  (1UL << 6)
#define PIN7  (1UL << 7)
#define PIN8  (1UL << 8)
#define PIN9  (1UL << 9)
#define PIN10 (1UL << 10)
#define PIN11 (1UL << 11)
#define PIN12 (1UL << 12)
#define PIN13 (1UL << 13)
#define PIN14 (1UL << 14)
#define PIN15 (1UL << 15)
#define PIN16 (1UL << 16)
#define PIN17 (1UL << 17)
#define PIN18 (1UL << 18)
#define PIN19 (1UL << 19)
#define PIN20 (1UL << 20)
#define PIN21 (1UL << 21)
#define PIN22 (1UL << 22)
#define PIN23 (1UL << 23)
#define PIN24 (1UL << 24)
#define PIN25 (1UL << 25)
#define PIN26 (1UL << 26)
#define PIN27 (1UL << 27)
#define PIN28 (1UL << 28)
#define PIN29 (1UL << 29)
#define PIN30 (1UL << 30)
#define PIN31 (1UL << 31)


/**************************************************/
/*   Rename of Registers                          */
/**************************************************/

