bmaayandexru/Polish/Drivers/LPC1768_define.h
// Rename of Pin Function Select Registers (PINSELx)
//--------------------------------------------------
//
#define PORT0_0_to_15_FUNCTION      PINSEL0
#define PORT0_16_to_31_FUNCTION     PINSEL1
#define PORT1_0_to_15_FUNCTION      PINSEL2
#define PORT1_16_to_31_FUNCTION     PINSEL3
#define PORT2_0_to_15_FUNCTION      PINSEL4
#define PORT2_16_to_31_FUNCTION     PINSEL5
#define PORT3_0_to_15_FUNCTION      PINSEL6
#define PORT3_16_to_31_FUNCTION     PINSEL7
#define PORT4_0_to_15_FUNCTION      PINSEL8
#define PORT4_16_to_31_FUNCTION     PINSEL9
#define PORT2_2_to_6_TRACE_FUNCTION PINSEL10

// Rename of Pin Mode Select Registers (PINMODEx)
//--------------------------------------------------
//
#define PORT0_0_to_15_PULL_MODE     PINMODE0
#define PORT0_16_to_31_PULL_MODE    PINMODE1
#define PORT1_0_to_15_PULL_MODE     PINMODE2
#define PORT1_16_to_31_PULL_MODE    PINMODE3
#define PORT2_0_to_15_PULL_MODE     PINMODE4
#define PORT3_16_to_31_PULL_MODE    PINMODE7
#define PORT4_16_to_31_PULL_MODE    PINMODE9

// Rename of Open Drain Pin Mode Select Registes (PINMODE_ODx)
//--------------------------------------------------
//
#define PORT0_OPENDRAIN_MODE        PINMODE_OD0
#define PORT1_OPENDRAIN_MODE        PINMODE_OD1
#define PORT2_OPENDRAIN_MODE        PINMODE_OD2
#define PORT3_OPENDRAIN_MODE        PINMODE_OD3
#define PORT4_OPENDRAIN_MODE        PINMODE_OD4


/**************************************************/
/*   Configure I/O ports                          */
/**************************************************/

// Port0-Port4 Primary functions (reset values)
//---------------------------------
//
#define PIN0_as_GPIO   (b00 << 0)
#define PIN1_as_GPIO   (b00 << 2)
#define PIN2_as_GPIO   (b00 << 4)
#define PIN3_as_GPIO   (b00 << 6)
#define PIN4_as_GPIO   (b00 << 8)
#define PIN5_as_GPIO   (b00 << 10)
#define PIN6_as_GPIO   (b00 << 12)
#define PIN7_as_GPIO   (b00 << 14)
#define PIN8_as_GPIO   (b00 << 16)
#define PIN9_as_GPIO   (b00 << 18)
#define PIN10_as_GPIO  (b00 << 20)
#define PIN11_as_GPIO  (b00 << 22)
#define PIN12_as_GPIO  (b00 << 24)
#define PIN13_as_GPIO  (b00 << 26)
#define PIN14_as_GPIO  (b00 << 28)
#define PIN15_as_GPIO  (b00 << 30)
#define PIN16_as_GPIO  (b00 << 0)
#define PIN17_as_GPIO  (b00 << 2)
#define PIN18_as_GPIO  (b00 << 4)
#define PIN19_as_GPIO  (b00 << 6)
#define PIN20_as_GPIO  (b00 << 8)
#define PIN21_as_GPIO  (b00 << 10)
#define PIN22_as_GPIO  (b00 << 12)
#define PIN23_as_GPIO  (b00 << 14)
#define PIN24_as_GPIO  (b00 << 16)
#define PIN25_as_GPIO  (b00 << 18)
#define PIN26_as_GPIO  (b00 << 20)
#define PIN27_as_GPIO  (b00 << 22)
#define PIN28_as_GPIO  (b00 << 24)
#define PIN29_as_GPIO  (b00 << 26)
#define PIN30_as_GPIO  (b00 << 28)
#define PIN31_as_GPIO  (b00 << 30)


// Port0 First alternate functions
//-----------------------------------
//
#define PIN0_as_RD1       (b01 << 0)
#define PIN1_as_TD1       (b01 << 2)
#define PIN2_as_TXD0      (b01 << 4)
#define PIN3_as_RXD0      (b01 << 6)
#define PIN4_as_I2SRX_CLK (b01 << 8)
#define PIN5_as_I2SRX_WS  (b01 << 10)
#define PIN6_as_I2SRX_SDA (b01 << 12)
#define PIN7_as_I2STX_CLK (b01 << 14)
#define PIN8_as_I2STX_WS  (b01 << 16)
#define PIN9_as_I2STX_SDA (b01 << 18)
#define PIN10_as_TXD2     (b01 << 20)
#define PIN11_as_RXD2     (b01 << 22)
// Port0 Pin12 reserved
// Port0 Pin13 reserved
// Port0 Pin14 reserved
#define PIN15_as_TXD1     (b01 << 30)
#define PIN16_as_RXD1     (b01 << 0)
#define PIN17_as_CTS1     (b01 << 2)
#define PIN18_as_DCD1     (b01 << 4)
#define PIN19_as_DSR1     (b01 << 6)
#define PIN20_as_DTR1     (b01 << 8)
#define PIN21_as_RI1      (b01 << 10)
#define PIN22_as_RTS1     (b01 << 12)
#define PIN23_as_AD0_0    (b01 << 14)
#define PIN24_as_AD0_1    (b01 << 16)
#define PIN25_as_AD0_2    (b01 << 18)
#define PIN26_as_AD0_3    (b01 << 20)
#define PIN27_as_SDA0     (b01 << 22)
#define PIN28_as_SCL0     (b01 << 24)
#define PIN29_as_USB_DP   (b01 << 26)
#define PIN30_as_USB_DM   (b01 << 28)
// Port0 Pin31 reserved


// Port0 Second alternate functions
//------------------------------------
//
#define PIN0_as_TXD3       (b10 << 0)
#define PIN1_as_RXD3       (b10 << 2)
#define PIN2_as_AD0_7      (b10 << 4)
#define PIN3_as_AD0_6      (b10 << 6)
#define PIN4_as_RD2        (b10 << 8)
#define PIN5_as_TD2        (b10 << 10)
#define PIN6_as_SSEL1      (b10 << 12)
#define PIN7_as_SCK1       (b10 << 14)
#define PIN8_as_MISO1      (b10 << 16)
#define PIN9_as_MOSI1      (b10 << 18)
#define PIN10_as_SDA2      (b10 << 20)
#define PIN11_as_SCL2      (b10 << 22)
// Port0 Pin12 reserved
// Port0 Pin13 reserved
// Port0 Pin14 reserved
#define PIN15_as_SCK0      (b10 << 30)
#define PIN16_as_SSEL0     (b10 << 0)
#define PIN17_as_MISO0     (b10 << 2)
#define PIN18_as_MOSI0     (b10 << 4)
// Port0 Pin19 reserved
// Port0 Pin20 reserved
// Port0 Pin21 reserved
// Port0 Pin22 reserved
#define PIN23_as_I2SRX_CLK (b10 << 14)
#define PIN24_as_I2SRX_WS  (b10 << 16)
#define PIN25_as_I2SRX_SDA (b10 << 18)
#define PIN26_as_AOUT      (b10 << 20)
#define PIN27_as_USB_SDA   (b10 << 22)
#define PIN28_as_USB_SCL   (b10 << 24)
// Port0 Pin29 reserved
// Port0 Pin30 reserved
// Port0 Pin31 reserved


// Port0 Third alternate functions
//---------------------------------
//
#define PIN0_as_SDA1    (b11 << 0)
#define PIN1_as_SCL1    (b11 << 2)
// Port0 Pin2 reserved
// Port0 Pin3 reserved
#define PIN4_as_CAP2_0  (b11 << 8)
#define PIN5_as_CAP2_1  (b11 << 10)
#define PIN6_as_MAT2_0  (b11 << 12)
#define PIN7_as_MAT2_1  (b11 << 14)
#define PIN8_as_MAT2_2  (b11 << 16)
#define PIN9_as_MAT2_3  (b11 << 18)
#define PIN10_as_MAT3_0 (b11 << 20)
#define PIN11_as_MAT3_1 (b11 << 22)
// Port0 Pin12 reserved
// Port0 Pin13 reserved
// Port0 Pin14 reserved
#define PIN15_as_SCK    (b11 << 30)
#define PIN16_as_SSEL   (b11 << 0)
#define PIN17_as_MISO   (b11 << 2)
#define PIN18_as_MOSI   (b11 << 4)
#define PIN19_as_SDA1   (b11 << 6)
#define PIN20_as_SCL1   (b11 << 8)
#define PIN21_as_RD1    (b11 << 10)
#define PIN22_as_TD1    (b11 << 12)
#define PIN23_as_CAP3_0 (b11 << 14)
#define PIN24_as_CAP3_1 (b11 << 16)
#define PIN25_as_TXD3   (b11 << 18)
#define PIN26_as_RXD3   (b11 << 20)
// Port0 Pin27 reserved
// Port0 Pin28 reserved
// Port0 Pin29 reserved
// Port0 Pin30 reserved
// Port0 Pin31 reserved


// Port1 First alternate functions
//--------------------------------------
//
#define PIN0_as_ENET_TXD0     (b01 << 0)
#define PIN1_as_ENET_TXD1     (b01 << 2)
// Port1 Pin2 reserved
// Port1 Pin3 reserved
#define PIN4_as_ENET_TX_EN    (b01 << 8)
// Port1 Pin5 reserved
// Port1 Pin6 reserved
// Port1 Pin7 reserved
#define PIN8_as_ENET_CRS      (b01 << 16)
#define PIN9_as_ENET_RXD0     (b01 << 18)
#define PIN10_as_ENET_RXD1    (b01 << 20)
// Port1 Pin11 reserved
// Port1 Pin12 reserved
// Port1 Pin13 reserved
#define PIN14_as_ENET_RX_ER   (b01 << 28)
#define PIN15_as_ENET_REF_CLK (b01 << 30)
#define PIN16_as_ENET_MDC     (b01 << 0)
#define PIN17_as_ENET_MDIO    (b01 << 2)
#define PIN18_as_USB_UP_LED   (b01 << 4)
#define PIN19_as_MCOA0        (b01 << 6)
#define PIN20_as_MCI0         (b01 << 8)
#define PIN21_as_nMCABORT     (b01 << 10)
#define PIN22_as_MCOB0        (b01 << 12)
#define PIN23_as_MCI1         (b01 << 14)
#define PIN24_as_MCI2         (b01 << 16)
#define PIN25_as_MCOA1        (b01 << 18)
#define PIN26_as_MCOB1        (b01 << 20)
#define PIN27_as_CLKOUT       (b01 << 22)
#define PIN28_as_MCOA2        (b01 << 24)
#define PIN29_as_MCOB2        (b01 << 26)
// Port1 Pin30 reserved
// Port1 Pin31 reserved


