bmaayandexru/Polish/Drivers/LPC1768_define.h
// Port1 Second alternate functions
//------------------------------------
//
// Port1 Pin0 reserved
// Port1 Pin1 reserved
// Port1 Pin2 reserved
// Port1 Pin3 reserved
// Port1 Pin4 reserved
// Port1 Pin5 reserved
// Port1 Pin6 reserved
// Port1 Pin7 reserved
// Port1 Pin8 reserved
// Port1 Pin9 reserved
// Port1 Pin10 reserved
// Port1 Pin11 reserved
// Port1 Pin12 reserved
// Port1 Pin13 reserved
// Port1 Pin14 reserved
// Port1 Pin15 reserved
// Port1 Pin16 reserved
// Port1 Pin17 reserved
#define PIN18_as_PWM1_1     (b10 << 4)
#define PIN19_as_nUSB_PPWR  (b10 << 6)
#define PIN20_as_PWM1_2     (b10 << 8)
#define PIN21_as_PWM1_3     (b10 << 10)
#define PIN22_as_USB_PWRD   (b10 << 12)
#define PIN23_as_PWM1_4     (b10 << 14)
#define PIN24_as_PWM1_5     (b10 << 16)
// Port1 Pin25 reserved
#define PIN26_as_PWM1_6     (b10 << 20)
#define PIN27_as_nUSB_OVRCR (b10 << 22)
#define PIN28_as_PCAP1_0    (b10 << 24)
#define PIN29_as_PCAP1_1    (b10 << 26)
#define PIN30_as_VBUS       (b10 << 28)
#define PIN31_as_SCK1       (b10 << 30)


// Port1 Third alternate functions
//--------------------------------
//
// Port1 Pin0 reserved
// Port1 Pin1 reserved
// Port1 Pin2 reserved
// Port1 Pin3 reserved
// Port1 Pin4 reserved
// Port1 Pin5 reserved
// Port1 Pin6 reserved
// Port1 Pin7 reserved
// Port1 Pin8 reserved
// Port1 Pin9 reserved
// Port1 Pin10 reserved
// Port1 Pin11 reserved
// Port1 Pin12 reserved
// Port1 Pin13 reserved
// Port1 Pin14 reserved
// Port1 Pin15 reserved
// Port1 Pin16 reserved
// Port1 Pin17 reserved
#define PIN18_as_CAP1_0 (b11 << 4)
#define PIN19_as_CAP1_1 (b11 << 6)
#define PIN20_as_SCK0   (b11 << 8)
#define PIN21_as_SSEL0  (b11 << 10)
#define PIN22_as_MAT1_0 (b11 << 12)
#define PIN23_as_MISO0  (b11 << 14)
#define PIN24_as_MOSI0  (b11 << 16)
#define PIN25_as_MAT1_1 (b11 << 18)
#define PIN26_as_CAP0_0 (b11 << 20)
#define PIN27_as_CAP0_1 (b11 << 22)
#define PIN28_as_MAT0_0 (b11 << 24)
#define PIN29_as_MAT0_1 (b11 << 26)
#define PIN30_as_AD0_4  (b11 << 28)
#define PIN31_as_AD0_5  (b11 << 30)


// Port2 First alternate functions
//-------------------------------------
//
#define PIN0_as_PWM1_1      (b01 << 0)
#define PIN1_as_PWM1_2      (b01 << 2)
#define PIN2_as_PWM1_3      (b01 << 4)
#define PIN3_as_PWM1_4      (b01 << 6)
#define PIN4_as_PWM1_5      (b01 << 8)
#define PIN5_as_PWM1_6      (b01 << 10)
#define PIN6_as_PCAP1_0     (b01 << 12)
#define PIN7_as_RD2         (b01 << 14)
#define PIN8_as_TD2         (b01 << 16)
#define PIN9_as_USB_CONNECT (b01 << 18)
#define PIN10_as_nEINT0     (b01 << 20)
#define PIN11_as_nEINT1     (b01 << 22)
#define PIN12_as_nEINT2     (b01 << 24)
#define PIN13_as_nEINT3     (b01 << 26)
// Port2 Pin14 reserved
// Port2 Pin15 reserved
// Port2 Pin16 reserved
// Port2 Pin17 reserved
// Port2 Pin18 reserved
// Port2 Pin19 reserved
// Port2 Pin20 reserved
// Port2 Pin21 reserved
// Port2 Pin22 reserved
// Port2 Pin23 reserved
// Port2 Pin24 reserved
// Port2 Pin25 reserved
// Port2 Pin26 reserved
// Port2 Pin27 reserved
// Port2 Pin28 reserved
// Port2 Pin29 reserved
// Port2 Pin30 reserved
// Port2 Pin31 reserved


// Port2 Second alternate functions
//---------------------------------
//
#define PIN0_as_TXD1    (b10 << 0)
#define PIN1_as_RXD1    (b10 << 2)
#define PIN2_as_CTS1    (b10 << 4)
#define PIN3_as_DCD1    (b10 << 6)
#define PIN4_as_DSR1    (b10 << 8)
#define PIN5_as_DTR1    (b10 << 10)
#define PIN6_as_RI1     (b10 << 12)
#define PIN7_as_RTS1    (b10 << 14)
#define PIN8_as_TXD2    (b10 << 16)
#define PIN9_as_RXD2    (b10 << 18)
#define PIN10_as_NMI    (b10 << 20)
// Port2 Pin11 reserved
// Port2 Pin12 reserved
// Port2 Pin13 reserved
// Port2 Pin14 reserved
// Port2 Pin15 reserved
// Port2 Pin16 reserved
// Port2 Pin17 reserved
// Port2 Pin18 reserved
// Port2 Pin19 reserved
// Port2 Pin20 reserved
// Port2 Pin21 reserved
// Port2 Pin22 reserved
// Port2 Pin23 reserved
// Port2 Pin24 reserved
// Port2 Pin25 reserved
// Port2 Pin26 reserved
// Port2 Pin27 reserved
// Port2 Pin28 reserved
// Port2 Pin29 reserved
// Port2 Pin30 reserved
// Port2 Pin31 reserved


// Port2 Third alternate functions
//---------------------------------

// Port2 Pin0 reserved
// Port2 Pin1 reserved
// Port2 Pin2 reserved
// Port2 Pin3 reserved
// Port2 Pin4 reserved
// Port2 Pin5 reserved
// Port2 Pin6 reserved
// Port2 Pin7 reserved
#define PIN8_as_ENET_MDC   (b11 << 16)
#define PIN9_as_ENET_MDIO  (b11 << 18)
// Port2 Pin10 reserved
#define PIN11_as_I2STX_CLK (b11 << 22)
#define PIN12_as_I2STX_WS  (b11 << 24)
#define PIN13_as_I2STX_SDA (b11 << 26)
// Port2 Pin14 reserved
// Port2 Pin15 reserved
// Port2 Pin16 reserved
// Port2 Pin17 reserved
// Port2 Pin18 reserved
// Port2 Pin19 reserved
// Port2 Pin20 reserved
// Port2 Pin21 reserved
// Port2 Pin22 reserved
// Port2 Pin23 reserved
// Port2 Pin24 reserved
// Port2 Pin25 reserved
// Port2 Pin26 reserved
// Port2 Pin27 reserved
// Port2 Pin28 reserved
// Port2 Pin29 reserved
// Port2 Pin30 reserved
// Port2 Pin31 reserved


// Port3 First alternate functions
//--------------------------------
//
// Port3 Pin0 reserved
// Port3 Pin1 reserved
// Port3 Pin2 reserved
// Port3 Pin3 reserved
// Port3 Pin4 reserved
// Port3 Pin5 reserved
// Port3 Pin6 reserved
// Port3 Pin7 reserved
// Port3 Pin8 reserved
// Port3 Pin9 reserved
// Port3 Pin10 reserved
// Port3 Pin11 reserved
// Port3 Pin12 reserved
// Port3 Pin13 reserved
// Port3 Pin14 reserved
// Port3 Pin15 reserved
// Port3 Pin16 reserved
// Port3 Pin17 reserved
// Port3 Pin18 reserved
// Port3 Pin19 reserved
// Port3 Pin20 reserved
// Port3 Pin21 reserved
// Port3 Pin22 reserved
// Port3 Pin23 reserved
// Port3 Pin24 reserved
// Port3 Pin25 reserved
#define PIN26_as_STCLK (b01 << 20)
// Port3 Pin27 reserved
// Port3 Pin28 reserved
// Port3 Pin29 reserved
// Port3 Pin30 reserved
// Port3 Pin31 reserved


// Port3 Second alternate functions
//---------------------------------
//
// Port3 Pin0 reserved
// Port3 Pin1 reserved
// Port3 Pin2 reserved
// Port3 Pin3 reserved
// Port3 Pin4 reserved
// Port3 Pin5 reserved
// Port3 Pin6 reserved
// Port3 Pin7 reserved
// Port3 Pin8 reserved
// Port3 Pin9 reserved
// Port3 Pin10 reserved
// Port3 Pin11 reserved
// Port3 Pin12 reserved
// Port3 Pin13 reserved
// Port3 Pin14 reserved
// Port3 Pin15 reserved
// Port3 Pin16 reserved
// Port3 Pin17 reserved
// Port3 Pin18 reserved
// Port3 Pin19 reserved
// Port3 Pin20 reserved
// Port3 Pin21 reserved
// Port3 Pin22 reserved
// Port3 Pin23 reserved
// Port3 Pin24 reserved
#define PIN25_as_MAT0_0 (b10 << 18)
#define PIN26_as_MAT0_1 (b10 << 20)
// Port3 Pin27 reserved
// Port3 Pin28 reserved
// Port3 Pin29 reserved
// Port3 Pin30 reserved
// Port3 Pin31 reserved


// Port3 Third alternate functions
//--------------------------------
//
// Port3 Pin0 reserved
// Port3 Pin1 reserved
// Port3 Pin2 reserved
// Port3 Pin3 reserved
// Port3 Pin4 reserved
// Port3 Pin5 reserved
// Port3 Pin6 reserved
// Port3 Pin7 reserved
// Port3 Pin8 reserved
// Port3 Pin9 reserved
// Port3 Pin10 reserved
// Port3 Pin11 reserved
// Port3 Pin12 reserved
// Port3 Pin13 reserved
// Port3 Pin14 reserved
// Port3 Pin15 reserved
// Port3 Pin16 reserved
// Port3 Pin17 reserved
// Port3 Pin18 reserved
// Port3 Pin19 reserved
// Port3 Pin20 reserved
// Port3 Pin21 reserved
// Port3 Pin22 reserved
// Port3 Pin23 reserved
// Port3 Pin24 reserved
#define PIN25_as_PWM1_2 (b11 << 18)
#define PIN26_as_PWM1_3 (b11 << 20)
// Port3 Pin27 reserved
// Port3 Pin28 reserved
// Port3 Pin29 reserved
// Port3 Pin30 reserved
// Port3 Pin31 reserved


// Port4 First alternate functions
//--------------------------------
//
// Port4 Pin0 reserved
// Port4 Pin1 reserved
// Port4 Pin2 reserved
// Port4 Pin3 reserved
// Port4 Pin4 reserved
// Port4 Pin5 reserved
// Port4 Pin6 reserved
// Port4 Pin7 reserved
// Port4 Pin8 reserved
// Port4 Pin9 reserved
// Port4 Pin10 reserved
// Port4 Pin11 reserved
// Port4 Pin12 reserved
// Port4 Pin13 reserved
// Port4 Pin14 reserved
// Port4 Pin15 reserved
// Port4 Pin16 reserved
// Port4 Pin17 reserved
// Port4 Pin18 reserved
// Port4 Pin19 reserved
// Port4 Pin20 reserved
// Port4 Pin21 reserved
// Port4 Pin22 reserved
// Port4 Pin23 reserved
// Port4 Pin24 reserved
// Port4 Pin25 reserved
// Port4 Pin26 reserved
// Port4 Pin27 reserved
#define PIN28_as_RX_MCLK (b01 << 24)
#define PIN29_as_TX_MCLK (b01 << 26)
// Port4 Pin30 reserved
// Port4 Pin31 reserved


// Port4 Second alternate functions
//---------------------------------
//
// Port4 Pin0 reserved
// Port4 Pin1 reserved
// Port4 Pin2 reserved
// Port4 Pin3 reserved
// Port4 Pin4 reserved
// Port4 Pin5 reserved
// Port4 Pin6 reserved
// Port4 Pin7 reserved
// Port4 Pin8 reserved
// Port4 Pin9 reserved
// Port4 Pin10 reserved
// Port4 Pin11 reserved
// Port4 Pin12 reserved
// Port4 Pin13 reserved
// Port4 Pin14 reserved
// Port4 Pin15 reserved
// Port4 Pin16 reserved
// Port4 Pin17 reserved
// Port4 Pin18 reserved
// Port4 Pin19 reserved
// Port4 Pin20 reserved
// Port4 Pin21 reserved
// Port4 Pin22 reserved
// Port4 Pin23 reserved
// Port4 Pin24 reserved
// Port4 Pin25 reserved
// Port4 Pin26 reserved
// Port4 Pin27 reserved
#define PIN28_as_MAT2_0 (b10 << 24)
#define PIN29_as_MAT2_1 (b10 << 26)
// Port4 Pin30 reserved
// Port4 Pin31 reserved


