bmaayandexru/Polish/Drivers/LPC1768_define.h
// Port4 Third alternate functions
//--------------------------------
//
// Port4 Pin0 reserved
// Port4 Pin1 reserved
// Port4 Pin2 reserved
// Port4 Pin3 reserved
// Port4 Pin4 reserved
// Port4 Pin5 reserved
// Port4 Pin6 reserved
// Port4 Pin7 reserved
// Port4 Pin8 reserved
// Port4 Pin9 reserved
// Port4 Pin10 reserved
// Port4 Pin11 reserved
// Port4 Pin12 reserved
// Port4 Pin13 reserved
// Port4 Pin14 reserved
// Port4 Pin15 reserved
// Port4 Pin16 reserved
// Port4 Pin17 reserved
// Port4 Pin18 reserved
// Port4 Pin19 reserved
// Port4 Pin20 reserved
// Port4 Pin21 reserved
// Port4 Pin22 reserved
// Port4 Pin23 reserved
// Port4 Pin24 reserved
// Port4 Pin25 reserved
// Port4 Pin26 reserved
// Port4 Pin27 reserved
#define PIN28_as_TXD3 (b11 << 24)
#define PIN29_as_RXD3 (b11 << 26)
// Port4 Pin30 reserved
// Port4 Pin31 reserved


// Port2 Pin2-Pin6 Trace function
//---------------------------------
//
#define TRACE_ENABLED  (1 << 3)
#define TRACE_DISABLED (0 << 3)


// Port0-Port4 on-chip pull-up resistor control (reset values)
//---------------------------------
//
#define PIN0_PULLUP    (b00 << 0)
#define PIN1_PULLUP    (b00 << 2)
#define PIN2_PULLUP    (b00 << 4)
#define PIN3_PULLUP    (b00 << 6)
#define PIN4_PULLUP    (b00 << 8)
#define PIN5_PULLUP    (b00 << 10)
#define PIN6_PULLUP    (b00 << 12)
#define PIN7_PULLUP    (b00 << 14)
#define PIN8_PULLUP    (b00 << 16)
#define PIN9_PULLUP    (b00 << 18)
#define PIN10_PULLUP   (b00 << 20)
#define PIN11_PULLUP   (b00 << 22)
#define PIN12_PULLUP   (b00 << 24)
#define PIN13_PULLUP   (b00 << 26)
#define PIN14_PULLUP   (b00 << 28)
#define PIN15_PULLUP   (b00 << 30)
#define PIN16_PULLUP   (b00 << 0)
#define PIN17_PULLUP   (b00 << 2)
#define PIN18_PULLUP   (b00 << 4)
#define PIN19_PULLUP   (b00 << 6)
#define PIN20_PULLUP   (b00 << 8)
#define PIN21_PULLUP   (b00 << 10)
#define PIN22_PULLUP   (b00 << 12)
#define PIN23_PULLUP   (b00 << 14)
#define PIN24_PULLUP   (b00 << 16)
#define PIN25_PULLUP   (b00 << 18)
#define PIN26_PULLUP   (b00 << 20)
#define PIN27_PULLUP   (b00 << 22)
#define PIN28_PULLUP   (b00 << 24)
#define PIN29_PULLUP   (b00 << 26)
#define PIN30_PULLUP   (b00 << 28)
#define PIN31_PULLUP   (b00 << 30)


// Port0-Port4 on-chip pull-down resistor control
//---------------------------------
//
#define PIN0_PULLDOWN  (b11 << 0)
#define PIN1_PULLDOWN  (b11 << 2)
#define PIN2_PULLDOWN  (b11 << 4)
#define PIN3_PULLDOWN  (b11 << 6)
#define PIN4_PULLDOWN  (b11 << 8)
#define PIN5_PULLDOWN  (b11 << 10)
#define PIN6_PULLDOWN  (b11 << 12)
#define PIN7_PULLDOWN  (b11 << 14)
#define PIN8_PULLDOWN  (b11 << 16)
#define PIN9_PULLDOWN  (b11 << 18)
#define PIN10_PULLDOWN (b11 << 20)
#define PIN11_PULLDOWN (b11 << 22)
#define PIN12_PULLDOWN (b11 << 24)
#define PIN13_PULLDOWN (b11 << 26)
#define PIN14_PULLDOWN (b11 << 28)
#define PIN15_PULLDOWN (b11 << 30)
#define PIN16_PULLDOWN (b11 << 0)
#define PIN17_PULLDOWN (b11 << 2)
#define PIN18_PULLDOWN (b11 << 4)
#define PIN19_PULLDOWN (b11 << 6)
#define PIN20_PULLDOWN (b11 << 8)
#define PIN21_PULLDOWN (b11 << 10)
#define PIN22_PULLDOWN (b11 << 12)
#define PIN23_PULLDOWN (b11 << 14)
#define PIN24_PULLDOWN (b11 << 16)
#define PIN25_PULLDOWN (b11 << 18)
#define PIN26_PULLDOWN (b11 << 20)
#define PIN27_PULLDOWN (b11 << 22)
#define PIN28_PULLDOWN (b11 << 24)
#define PIN29_PULLDOWN (b11 << 26)
#define PIN30_PULLDOWN (b11 << 28)
#define PIN31_PULLDOWN (b11 << 30)


// Port0-Port4 repeater mode control
//---------------------------------
//
#define PIN0_REPEATER  (b01 << 0)
#define PIN1_REPEATER  (b01 << 2)
#define PIN2_REPEATER  (b01 << 4)
#define PIN3_REPEATER  (b01 << 6)
#define PIN4_REPEATER  (b01 << 8)
#define PIN5_REPEATER  (b01 << 10)
#define PIN6_REPEATER  (b01 << 12)
#define PIN7_REPEATER  (b01 << 14)
#define PIN8_REPEATER  (b01 << 16)
#define PIN9_REPEATER  (b01 << 18)
#define PIN10_REPEATER (b01 << 20)
#define PIN11_REPEATER (b01 << 22)
#define PIN12_REPEATER (b01 << 24)
#define PIN13_REPEATER (b01 << 26)
#define PIN14_REPEATER (b01 << 28)
#define PIN15_REPEATER (b01 << 30)
#define PIN16_REPEATER (b01 << 0)
#define PIN17_REPEATER (b01 << 2)
#define PIN18_REPEATER (b01 << 4)
#define PIN19_REPEATER (b01 << 6)
#define PIN20_REPEATER (b01 << 8)
#define PIN21_REPEATER (b01 << 10)
#define PIN22_REPEATER (b01 << 12)
#define PIN23_REPEATER (b01 << 14)
#define PIN24_REPEATER (b01 << 16)
#define PIN25_REPEATER (b01 << 18)
#define PIN26_REPEATER (b01 << 20)
#define PIN27_REPEATER (b01 << 22)
#define PIN28_REPEATER (b01 << 24)
#define PIN29_REPEATER (b01 << 26)
#define PIN30_REPEATER (b01 << 28)
#define PIN31_REPEATER (b01 << 30)


// Port0-Port4 neither pull-up nor pull-down control
//---------------------------------
//
#define PIN0_NOPULL    (b10 << 0)
#define PIN1_NOPULL    (b10 << 2)
#define PIN2_NOPULL    (b10 << 4)
#define PIN3_NOPULL    (b10 << 6)
#define PIN4_NOPULL    (b10 << 8)
#define PIN5_NOPULL    (b10 << 10)
#define PIN6_NOPULL    (b10 << 12)
#define PIN7_NOPULL    (b10 << 14)
#define PIN8_NOPULL    (b10 << 16)
#define PIN9_NOPULL    (b10 << 18)
#define PIN10_NOPULL   (b10 << 20)
#define PIN11_NOPULL   (b10 << 22)
#define PIN12_NOPULL   (b10 << 24)
#define PIN13_NOPULL   (b10 << 26)
#define PIN14_NOPULL   (b10 << 28)
#define PIN15_NOPULL   (b10 << 30)
#define PIN16_NOPULL   (b10 << 0)
#define PIN17_NOPULL   (b10 << 2)
#define PIN18_NOPULL   (b10 << 4)
#define PIN19_NOPULL   (b10 << 6)
#define PIN20_NOPULL   (b10 << 8)
#define PIN21_NOPULL   (b10 << 10)
#define PIN22_NOPULL   (b10 << 12)
#define PIN23_NOPULL   (b10 << 14)
#define PIN24_NOPULL   (b10 << 16)
#define PIN25_NOPULL   (b10 << 18)
#define PIN26_NOPULL   (b10 << 20)
#define PIN27_NOPULL   (b10 << 22)
#define PIN28_NOPULL   (b10 << 24)
#define PIN29_NOPULL   (b10 << 26)
#define PIN30_NOPULL   (b10 << 28)
#define PIN31_NOPULL   (b10 << 30)


// Port0-Port4 Open-Drain mode control
//---------------------------------
//
#define PIN0_OPENDRAIN_ENABLED  (1UL << 0)
#define PIN1_OPENDRAIN_ENABLED  (1UL << 1)
#define PIN2_OPENDRAIN_ENABLED  (1UL << 2)
#define PIN3_OPENDRAIN_ENABLED  (1UL << 3)
#define PIN4_OPENDRAIN_ENABLED  (1UL << 4)
#define PIN5_OPENDRAIN_ENABLED  (1UL << 5)
#define PIN6_OPENDRAIN_ENABLED  (1UL << 6)
#define PIN7_OPENDRAIN_ENABLED  (1UL << 7)
#define PIN8_OPENDRAIN_ENABLED  (1UL << 8)
#define PIN9_OPENDRAIN_ENABLED  (1UL << 9)
#define PIN10_OPENDRAIN_ENABLED (1UL << 10)
#define PIN11_OPENDRAIN_ENABLED (1UL << 11)
#define PIN12_OPENDRAIN_ENABLED (1UL << 12)
#define PIN13_OPENDRAIN_ENABLED (1UL << 13)
#define PIN14_OPENDRAIN_ENABLED (1UL << 14)
#define PIN15_OPENDRAIN_ENABLED (1UL << 15)
#define PIN16_OPENDRAIN_ENABLED (1UL << 16)
#define PIN17_OPENDRAIN_ENABLED (1UL << 17)
#define PIN18_OPENDRAIN_ENABLED (1UL << 18)
#define PIN19_OPENDRAIN_ENABLED (1UL << 19)
#define PIN20_OPENDRAIN_ENABLED (1UL << 20)
#define PIN21_OPENDRAIN_ENABLED (1UL << 21)
#define PIN22_OPENDRAIN_ENABLED (1UL << 22)
#define PIN23_OPENDRAIN_ENABLED (1UL << 23)
#define PIN24_OPENDRAIN_ENABLED (1UL << 24)
#define PIN25_OPENDRAIN_ENABLED (1UL << 25)
#define PIN26_OPENDRAIN_ENABLED (1UL << 26)
#define PIN27_OPENDRAIN_ENABLED (1UL << 27)
#define PIN28_OPENDRAIN_ENABLED (1UL << 28)
#define PIN29_OPENDRAIN_ENABLED (1UL << 29)
#define PIN30_OPENDRAIN_ENABLED (1UL << 30)
#define PIN31_OPENDRAIN_ENABLED (1UL << 31)


/**************************************************/
/*   GPIO CONFIGURE CONTROL                       */
/**************************************************/

// Rename of GPIO port Direction register (FIODIR)

#define PORT_DIRECTION FIODIR

// Direction Control bits for GPIO
//---------------------------------
//
#define PIN0_INPUT   (0UL << 0)
#define PIN1_INPUT   (0UL << 1)
#define PIN2_INPUT   (0UL << 2)
#define PIN3_INPUT   (0UL << 3)
#define PIN4_INPUT   (0UL << 4)
#define PIN5_INPUT   (0UL << 5)
#define PIN6_INPUT   (0UL << 6)
#define PIN7_INPUT   (0UL << 7)
#define PIN8_INPUT   (0UL << 8)
#define PIN9_INPUT   (0UL << 9)
#define PIN10_INPUT  (0UL << 10)
#define PIN11_INPUT  (0UL << 11)
#define PIN12_INPUT  (0UL << 12)
#define PIN13_INPUT  (0UL << 13)
#define PIN14_INPUT  (0UL << 14)
#define PIN15_INPUT  (0UL << 15)
#define PIN16_INPUT  (0UL << 16)
#define PIN17_INPUT  (0UL << 17)
#define PIN18_INPUT  (0UL << 18)
#define PIN19_INPUT  (0UL << 19)
#define PIN20_INPUT  (0UL << 20)
#define PIN21_INPUT  (0UL << 21)
#define PIN22_INPUT  (0UL << 22)
#define PIN23_INPUT  (0UL << 23)
#define PIN24_INPUT  (0UL << 24)
#define PIN25_INPUT  (0UL << 25)
#define PIN26_INPUT  (0UL << 26)
#define PIN27_INPUT  (0UL << 27)
#define PIN28_INPUT  (0UL << 28)
#define PIN29_INPUT  (0UL << 29)
#define PIN30_INPUT  (0UL << 30)
#define PIN31_INPUT  (0UL << 31)

