bmaayandexru/Polish/Drivers/LPC1768_define.h
#define PIN0_OUTPUT  (1UL << 0)
#define PIN1_OUTPUT  (1UL << 1)
#define PIN2_OUTPUT  (1UL << 2)
#define PIN3_OUTPUT  (1UL << 3)
#define PIN4_OUTPUT  (1UL << 4)
#define PIN5_OUTPUT  (1UL << 5)
#define PIN6_OUTPUT  (1UL << 6)
#define PIN7_OUTPUT  (1UL << 7)
#define PIN8_OUTPUT  (1UL << 8)
#define PIN9_OUTPUT  (1UL << 9)
#define PIN10_OUTPUT (1UL << 10)
#define PIN11_OUTPUT (1UL << 11)
#define PIN12_OUTPUT (1UL << 12)
#define PIN13_OUTPUT (1UL << 13)
#define PIN14_OUTPUT (1UL << 14)
#define PIN15_OUTPUT (1UL << 15)
#define PIN16_OUTPUT (1UL << 16)
#define PIN17_OUTPUT (1UL << 17)
#define PIN18_OUTPUT (1UL << 18)
#define PIN19_OUTPUT (1UL << 19)
#define PIN20_OUTPUT (1UL << 20)
#define PIN21_OUTPUT (1UL << 21)
#define PIN22_OUTPUT (1UL << 22)
#define PIN23_OUTPUT (1UL << 23)
#define PIN24_OUTPUT (1UL << 24)
#define PIN25_OUTPUT (1UL << 25)
#define PIN26_OUTPUT (1UL << 26)
#define PIN27_OUTPUT (1UL << 27)
#define PIN28_OUTPUT (1UL << 28)
#define PIN29_OUTPUT (1UL << 29)
#define PIN30_OUTPUT (1UL << 30)
#define PIN31_OUTPUT (1UL << 31)


/**************************************************/
/*   GPIO PORT OUTPUT SET/CLEAR CONTROL           */
/**************************************************/

// Rename of GPIO port output Set register (FIOSET)
// Rename of GPIO port output Clear register (FIOCLR)

#define PORT_SET FIOSET
#define PORT_CLEAR FIOCLR


/**************************************************/
/*   POWER CONTROL                                */
/**************************************************/

// Rename of Power Control for Peripherals register (PCONP)

#define POWER_CONTROL PCONP

// Power/Clock Control bits for Peripherals
//---------------------------------
//

// 0 - Reserved
#define TIMER0_POWERED    (1UL << 1)
#define TIMER1_POWERED    (1UL << 2)
#define UART0_POWERED     (1UL << 3)
#define UART1_POWERED     (1UL << 4)
// 5 - Reserved
#define PWM1_POWERED      (1UL << 6)
#define I2C0_POWERED      (1UL << 7)
#define SPI_POWERED       (1UL << 8)
#define RTC_POWERED       (1UL << 9)
#define SSP1_POWERED      (1UL << 10)
// 11 - Reserved
#define ADC_POWERED       (1UL << 12)
//Note:Clear the PDN bit in the AD0CR before clearing this bit, and set 
//this bit before setting PDN.
#define CAN1_POWERED      (1UL << 13)
#define CAN2_POWERED      (1UL << 14)
#define GPIO_POWERED      (1UL << 15)
#define INT_TIMER_POWERED (1UL << 16)
#define MOTORPWM_POWERED  (1UL << 17)
#define ENCODER_POWERED   (1UL << 18)
#define I2C1_POWERED      (1UL << 19)
// 20 - Reserved
#define SSP0_POWERED      (1UL << 21)
#define TIMER2_POWERED    (1UL << 22)
#define TIMER3_POWERED    (1UL << 23)
#define UART2_POWERED     (1UL << 24)
#define UART3_POWERED     (1UL << 25)
#define I2C_POWERED       (1UL << 26)
#define I2S_POWERED       (1UL << 27)
// 28 - Reserved
#define GPDMA_POWERED     (1UL << 29)
#define ETHERNET_POWERED  (1UL << 30)
#define USB_POWERED       (1UL << 31)





#endif  // __LPC1768_DEFINE_H__
